cask_args appdir: '/Applications'

tap 'caskroom/fonts'
tap 'dtan4/dtan4'
tap 'getantibody/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'minio/stable'

brew 'antibody'
brew 'awscli'
brew 'bat'
brew 'ctop'
brew 'diff-so-fancy'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'fpp'
brew 'fzf'
brew 'httpie'
brew 'git'
brew 'go'
brew 'jid'
brew 'jq'
brew 'k8sec'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'makeicns'
brew 'mas'
brew 'minio/stable/mc'
brew 'packer'
brew 'rbenv'
brew 'rbenv-bundler'
brew 'rclone'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'shellcheck'
brew 'shfmt'
brew 'ssh-copy-id'
brew 'stern'
brew 'svg2png'
brew 'tldr'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wifi-password'
brew 'wget'
brew 'yarn', args: ['ignore-dependencies']
brew 'z'
brew 'zsh'

# applications
cask '1password'
cask 'alfred'
cask 'authy'
cask 'balenaetcher'
cask 'bartender'
cask 'brave-browser'
cask 'cleanmymac3'
cask 'dash3'
cask 'docker'
cask 'evernote'
cask 'firefox'
cask 'gifox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'intellij-idea'
cask 'hyper'
cask 'iterm2'
cask 'lastfm'
cask 'mysqlworkbench'
cask 'ngrok'
cask 'paw'
cask 'philips-hue-sync'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'sequel-pro'
cask 'slack'
cask 'sketch'
cask 'skype'
cask 'sonos'
cask 'spectacle'
cask 'spotify'
cask 'spotify-notifications'
cask 'sublime-text'
cask 'suspicious-package'
cask 'tunnelbear'
cask 'tunnelblick'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vmware-fusion'
cask 'vlc'
cask 'webtorrent'
cask 'whatsapp'

# mas applications
mas 'Lungo', id: 1263070803
mas 'Todoist', id: 585829637
mas 'Tweetbot', id: 557168941

# fonts
cask 'font-source-code-pro'
